# Javascript 기초

- 주석  (comment)
  + `//`로 주석 표시
  + `/**/`로 주석 표시

- 자료형 (data type)
  + undefined, null, boolean, string, symbol, number and object (key and value)
  + 변수에 데이터를 담는다 (할당)  
    
   1) var : 모든 영역 사용
   2) let : 선언된 범위 내에 사용 가능
   3) const : 변하지 않는 변수를 선언하는 경우

- 연산자
  + +, -, *, /
  + ++, --
  + +=, -=, *=, /=
  + `"I am a \"double quoted\" "` 처럼 인용구 안에 인용구를 넣을 수 있음.

- 문자열 
  + `문자열.length` : 문자열의 길이를 추출
  + 또한 파이썬처럼 `[]`를 이용해 각 문자 추출 가능
  + 문자열은 `immutable`하다. 한번 선언하면 변경할 수 없다는 뜻. -> 문자열 자체는 바꿀 수 있지만 문자열 안의 문자를 바꿀 수 없다.
  + 마지막 문자는 `str[str.length - 1]`로 구할 수 있다.

- 배열
  + `mutable`하기 때문에 배열 중 하나의 요소에 접근하여 값을 바꿀 수 있다.
    + `.push(요소)` : 배열 마지막에 요소를 삽입
    + `.pop()` : 배열 마지막 요소를 없앰
    + `.shift()` : 배열의 첫 번째 요소를 없애고 반환
    + `.unshift(요소)` : 배열의 첫 번째 자리에 요소를 대체함

- 함수
  + var는 다른 함수에서도 (전역에서) 사용 가능
  + var를 생략한 경우에는 자동적으로 var로 인식해서 자료형 부과(~59'44")
